Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EV64GM004.h
/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Brown Out Reset Detection Bit:
**     BOREN0_OFF           BOR is Disabled
**     BOREN0_ON            BOR is Enabled
**
*/

#define BOREN0_OFF           0xFFFE
#define BOREN0_ON            0xFFFF

/* Register FICD (0xaba8)                               */

extern __attribute__((space(prog))) unsigned int _FICD;
#define _FICD(x) __attribute__((section("__FICD.sec"),space(prog))) unsigned int _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select Bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGEC3 and PGED3
**     ICS_PGD2             Communicate on PGEC2 and PGED2
**     ICS_PGD1             Communicate on PGEC1 and PGED1
**
*/

#define ICS_NONE             0xFFFC
#define ICS_PGD3             0xFFFD
#define ICS_PGD2             0xFFFE
#define ICS_PGD1             0xFFFF

/* Register FDMTINTVL (0xabac)                               */

extern __attribute__((space(prog))) unsigned int _FDMTINTVL;
#define _FDMTINTVL(x) __attribute__((section("__FDMTINTVL.sec"),space(prog))) unsigned int _FDMTINTVL = (x);

/*
** Only one invocation of FDMTINTVL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTINTVL.
** Multiple options may be combined, as shown:
**
** _FDMTINTVL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Lower 16 Bits of 32 Bit DMT Window Interval:
**
*/


/* Register FDMTINTVH (0xabb0)                               */

extern __attribute__((space(prog))) unsigned int _FDMTINTVH;
#define _FDMTINTVH(x) __attribute__((section("__FDMTINTVH.sec"),space(prog))) unsigned int _FDMTINTVH = (x);

/*
** Only one invocation of FDMTINTVH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTINTVH.
** Multiple options may be combined, as shown:
**
** _FDMTINTVH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Upper 16 Bits of 32 Bit DMT Window Interval:
**
*/


/* Register FDMTCNTL (0xabb4)                               */

extern __attribute__((space(prog))) unsigned int _FDMTCNTL;
#define _FDMTCNTL(x) __attribute__((section("__FDMTCNTL.sec"),space(prog))) unsigned int _FDMTCNTL = (x);

/*
** Only one invocation of FDMTCNTL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTL.
** Multiple options may be combined, as shown:
**
** _FDMTCNTL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Lower 16 Bits of 32 Bit DMT Instruction Count Time-Out Value:
**
*/


/* Register FDMTCNTH (0xabb8)                               */

extern __attribute__((space(prog))) unsigned int _FDMTCNTH;
#define _FDMTCNTH(x) __attribute__((section("__FDMTCNTH.sec"),space(prog))) unsigned int _FDMTCNTH = (x);

/*
** Only one invocation of FDMTCNTH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTH.
** Multiple options may be combined, as shown:
**
** _FDMTCNTH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Upper 16 Bits of 32 Bit DMT Instruction Count Time-Out Value:
**
*/


/* Register FDMT (0xabbc)                               */

extern __attribute__((space(prog))) unsigned int _FDMT;
#define _FDMT(x) __attribute__((section("__FDMT.sec"),space(prog))) unsigned int _FDMT = (x);

/*
** Only one invocation of FDMT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMT.
** Multiple options may be combined, as shown:
**
** _FDMT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Enable Bit:
**     DMTEN_DISABLE        Dead Man Timer is Disabled and can be enabled by software
**     DMTEN_ENABLE         Dead Man Timer is Enabled and cannot be disabled by software
**
*/

#define DMTEN_DISABLE        0xFFFE
#define DMTEN_ENABLE         0xFFFF

/* Register FDEVOPT (0xabc0)                               */

extern __attribute__((space(prog))) unsigned int _FDEVOPT;
#define _FDEVOPT(x) __attribute__((section("__FDEVOPT.sec"),space(prog))) unsigned int _FDEVOPT = (x);

/*
** Only one invocation of FDEVOPT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT.
** Multiple options may be combined, as shown:
**
** _FDEVOPT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   PWM Lock Enable Bit:
**     PWMLOCK_OFF          PWM registers may be written without key sequence
**     PWMLOCK_ON           Certain PWM registers may only be written after key sequence
**
**   Alternate I2C1 Pins Selection Bit:
**     ALTI2C1_ON           I2C1 mapped to ASDA1/ASCL1 pins
**     ALTI2C1_OFF          I2C1 mapped to SDA1/SCL1 pins
**
*/

#define PWMLOCK_OFF          0xFFFE
#define PWMLOCK_ON           0xFFFF

#define ALTI2C1_ON           0xFFF7
#define ALTI2C1_OFF          0xFFFF

/* Register FALTREG (0xabc4)                               */

extern __attribute__((space(prog))) unsigned int _FALTREG;
#define _FALTREG(x) __attribute__((section("__FALTREG.sec"),space(prog))) unsigned int _FALTREG = (x);

/*
** Only one invocation of FALTREG should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FALTREG.
** Multiple options may be combined, as shown:
**
** _FALTREG( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Interrupt Priority Level (IPL) Selection Bits For Alternate Working Register Set 1:
**     CTXT1_IPL1           Alternate register set 1 assigned to IPL level 1
**     CTXT1_IPL2           Alternate register set 1 assigned to IPL level 2
**     CTXT1_IPL3           Alternate register set 1 assigned to IPL level 3
**     CTXT1_IPL4           Alternate register set 1 assigned to IPL level 4
**     CTXT1_IPL5           Alternate register set 1 assigned to IPL level 5
**     CTXT1_IPL6           Alternate register set 1 assigned to IPL level 6
**     CTXT1_NONE           Not Assigned
**
**   Interrupt Priority Level (IPL) Selection Bits For Alternate Working Register Set 2:
**     CTXT2_IPL1           Alternate register set 2  assigned to IPL level 1
**     CTXT2_IPL2           Alternate register set 2  assigned to IPL level 2
**     CTXT2_IPL3           Alternate register set 2  assigned to IPL level 3
**     CTXT2_IPL4           Alternate register set 2  assigned to IPL level 4
**     CTXT2_IPL5           Alternate register set 2  assigned to IPL level 5
**     CTXT2_IPL6           Alternate register set 2  assigned to IPL level 6
**     CTXT2_NONE           Not Assigned
**
*/

#define CTXT1_IPL1           0xFFF9
#define CTXT1_IPL2           0xFFFA
#define CTXT1_IPL3           0xFFFB
#define CTXT1_IPL4           0xFFFC
#define CTXT1_IPL5           0xFFFD
#define CTXT1_IPL6           0xFFFE
#define CTXT1_NONE           0xFFFF

#define CTXT2_IPL1           0xFF9F
#define CTXT2_IPL2           0xFFAF
#define CTXT2_IPL3           0xFFBF
#define CTXT2_IPL4           0xFFCF
#define CTXT2_IPL5           0xFFDF
#define CTXT2_IPL6           0xFFEF
#define CTXT2_NONE           0xFFFF



/*
 * Memory Segments Sizes
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0xa980

#define __FSEC_BASE 0xab80
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0xab90
#define __FBSLIM_LENGTH 0x2

#define __FOSCSEL_BASE 0xab98
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xab9c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xaba0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xaba4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xaba8
#define __FICD_LENGTH 0x2

#define __FDMTINTVL_BASE 0xabac
#define __FDMTINTVL_LENGTH 0x2

#define __FDMTINTVH_BASE 0xabb0
#define __FDMTINTVH_LENGTH 0x2

#define __FDMTCNTL_BASE 0xabb4
#define __FDMTCNTL_LENGTH 0x2

#define __FDMTCNTH_BASE 0xabb8
#define __FDMTCNTH_LENGTH 0x2

#define __FDMT_BASE 0xabbc
#define __FDMT_LENGTH 0x2

#define __FDEVOPT_BASE 0xabc0
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0xabc4
#define __FALTREG_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000


#endif
